{
    "home": {
        "title": "Welcome",
        "description": "This is English version",
        "language": "Language",
        "work": "Work",
        "about": "About",
        "home": "Home",
        "heading": "HI, I AM",
        "headingName": "NGUYEN HONG PHONG",
        "introduction": "As a Software Engineer, I specialize in building modern, scalable, and performance-focused web applications using React, Next.js, and TypeScript.",
        "introduction_2": "With a solid foundation in SQL programming and database design, I develop robust systems that integrate clean architecture and deliver a seamless user experience from frontend to backend.",
        "core_competencies_1": "Frontend Engineering (Tailwind CSS, Bootstrap, SCSS, Responsive Design)",
        "core_competencies_2": "Backend API Design & Integration (REST, Authentication, Authorization)",
        "core_competencies_3": "SQL Programming & Database Optimization (MySQL, SQL)",
        "core_competencies_4": "Clean Code, Scalable Architecture, and Agile Collaboration",
        "more": "MORE ABOUT ME",
        "contact_me": "CONTACT ME",
        "subject_in_mail": "Contact to discuss",
        "content_in_mail": "I want to contact to you",
        "portfolio_heading": "PROJECTS",
        "portfolio_content": "Here are some of the selected projects that showcase my passion for front-end development.",
        "podcast_page_description": "Welcome to the Podcast page, where you can explore engaging stories, useful insights, and inspiring conversations every day.",
        "project_info": "PROJECT INFO",
        "project_year_info": "Year",
        "project_role_info": "Role",
        "portfolio_page_description": "Showcasing my projects, skills, and achievements in a clean and professional portfolio. Explore my work and see what I can create.",
        "banking_page_description": "A modern and secure banking platform that helps users manage transactions, savings, and financial insights with ease. Designed for convenience, transparency, and complete control over your money.",
        "about_me": "ABOUT ME",
        "core_competencies": "Core Competencies",
        "tools_used": "Tools",
        "databases_used": "Databases",
        "view_all": "View all"
    },
    "about": {
        "download_resume": "DOWNLOAD RESUME",
        "skills": "SKILLS",
        "short_description": "I am a web developer skilled in HTML, CSS, JavaScript, with strong UI design abilities using Figma and TailwindCSS. I have hands-on experience building applications with Node.js, React, and working with SQL databases. My goal is to create optimized, scalable, and cleanly structured products.",
        "experiences": "EXPERIENCES",
        "company": "COMPANY",
        "responsibilities": "Responsibilities",
        "go_fiber": {
            "responsibility_1": "Developed core business logic and system functionalities using NestJS and TypeScript.",
            "responsibility_2": "Conducted functional testing and fixed bugs to ensure system stability and reliability"
        },
        "tri_thuc": {
            "responsibility_1": "Created user registration forms and validated input data before inserting into the database",
            "responsibility_2": "Handled server-side logic to ensure smooth data processing and workflow",
            "responsibility_3": "Provided structural guidance and direction to other team members involved in the project"
        }
    },
    "webs_portfolio": {
        "title": "MY WORKS",
        "heading_greeting": "Hi! I'm Nguyen Hong Phong",
        "short_description": "I focus on building stable, scalable products that deliver a smooth and meaningful user experience. Throughout my work, I have developed various projects, ranging from web interfaces to server-side logic and database design.",
        "short_description_2": "Below are some of the featured projects I’ve created during my journey.",
        "tech_stack_use_with": "Tech stacks",
        "recent_ones": "RECENT ONES"
    }
}